public/demos.wsdl

<?xml version="1.0"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://localhost:8080/soap/v1/demos" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="App.Http.Controllers.DemoController" targetNamespace="http://localhost:8080/soap/v1/demos">
  <types>
    <xsd:schema targetNamespace="http://localhost:8080/soap/v1/demos">
      <xsd:import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>
    </xsd:schema>
  </types>
  <portType name="App.Http.Controllers.DemoControllerPort">
    <operation name="hello">
      <input message="tns:helloIn"/>
      <output message="tns:helloOut"/>
    </operation>
  </portType>
  <binding name="App.Http.Controllers.DemoControllerBinding" type="tns:App.Http.Controllers.DemoControllerPort">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="hello">
      <soap:operation soapAction="http://localhost:8080/soap/v1/demos#hello"/>
      <input>
        <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://localhost:8080/soap/v1/demos"/>
      </input>
      <output>
        <soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://localhost:8080/soap/v1/demos"/>
      </output>
    </operation>
  </binding>
  <message name="helloIn"/>
  <message name="helloOut">
    <part name="return" type="xsd:string"/>
  </message>
  <service name="App.Http.Controllers.DemoControllerService">
    <port name="App.Http.Controllers.DemoControllerPort" binding="tns:App.Http.Controllers.DemoControllerBinding">
      <soap:address location="http://localhost:8080/soap/v1/demos"/>
    </port>
  </service>
</definitions>
